{"sections":{"main":{"type":"main-product","blocks":{"vendor":{"type":"text","disabled":true,"settings":{"text":"{{ product.vendor }}","text_style":"uppercase"}},"title":{"type":"title","settings":{}},"66fe2760-9f50-4243-b727-15d1dd30a8cb":{"type":"shopify:\/\/apps\/product-reviews\/blocks\/star_rating\/bae150af-8da8-48b2-9867-398188115e5f","disabled":true,"settings":{"stars_fill_color":"#000000","star_size":15,"text_align":"center","product":"{{product}}","stars_text_empty":"No reviews"}},"description":{"type":"description","settings":{}},"price":{"type":"price","settings":{}},"variant_picker":{"type":"variant_picker","settings":{"picker_type":"button"}},"quantity_selector":{"type":"quantity_selector","settings":{"show_dynamic_checkout":false,"show_gift_card_recipient":false}},"share":{"type":"share","disabled":true,"settings":{"share_label":"Share"}}},"block_order":["vendor","title","66fe2760-9f50-4243-b727-15d1dd30a8cb","description","price","variant_picker","quantity_selector","share"],"settings":{"enable_sticky_info":true,"media_size":"large","constrain_to_viewport":true,"media_fit":"cover","gallery_layout":"thumbnail_slider","media_position":"left","image_zoom":"none","mobile_thumbnails":"show","hide_variants":true,"enable_video_looping":false,"padding_top":0,"padding_bottom":88}},"1699299147ec19a30f":{"type":"apps","blocks":{"96a75473-86f6-4a98-82a4-efc66a665a2e":{"type":"shopify:\/\/apps\/reputon-etsy-reviews\/blocks\/carousel-widget-block\/8df530b9-db50-44f9-a43b-c93c6bac56a9","settings":{"themeId":"light","autoscroll":true,"showRating":true,"showProductPicture":true,"showDate":true,"showAvatar":true}}},"block_order":["96a75473-86f6-4a98-82a4-efc66a665a2e"],"settings":{"include_margins":true}},"69ba3784-4356-4016-bd99-37fe72d2e5c9":{"type":"product_details_tabs","blocks":{"09ba5d3c-a7d9-4051-940a-66a51fea169b":{"type":"tab_title","settings":{"tab_title":"Product Details"}},"c0953258-76d3-4dcf-8820-464cf40dbd03":{"type":"tab_title","disabled":true,"settings":{"tab_title":"Reviews"}},"37d74d42-7a47-4b45-a24e-d896e008d76c":{"type":"tab_title","settings":{"tab_title":"What does the kit contain?"}},"feb4edda-ed42-4ff4-b828-f14c8a64efd6":{"type":"tab_title","settings":{"tab_title":"Product Installation Guide"}}},"block_order":["09ba5d3c-a7d9-4051-940a-66a51fea169b","c0953258-76d3-4dcf-8820-464cf40dbd03","37d74d42-7a47-4b45-a24e-d896e008d76c","feb4edda-ed42-4ff4-b828-f14c8a64efd6"],"settings":{"tab_content_3":"<h4>What does the kit contain?<\/h4><h4><\/h4><ul><li>Your incredible future illuminated sign<br\/> <\/li><li>Power supply: Each sign comes with a power supply. Just plug it in, like a lamp. We supply the right plug for your geographical location (EU, UK, USA, Australia). The cable is transparent and 3 meters long. It allows you to power your sign easily and discreetly.<br\/> <br\/><\/li><li>Dimmer: We also supply a dimmer that connects between your sign and the power supply. It lets you easily adjust the brightness of your sign to suit the mood of the room.<br\/> <br\/><\/li><li>Hanging system: Each sign is delivered with the selected hanging kit.<\/li><\/ul>","page_content_3":"","tab_content_4":"","page_content_4":"installation-guide"}},"related-products":{"type":"related-products","disabled":true,"settings":{"heading":"You may also like"}},"f16ad601-9b12-4ae9-9f01-3fe2e731fe47":{"type":"image-banner2","blocks":{"template--18586635469124__f16ad601-9b12-4ae9-9f01-3fe2e731fe47-1686395567ab2145bc-0":{"type":"heading","settings":{"heading":"Can't find the right product for you?"}},"template--18586635469124__f16ad601-9b12-4ae9-9f01-3fe2e731fe47-1686395567ab2145bc-1":{"type":"text","settings":{"text":"Create your own custom sign in just 5 minutes by clicking on the button below","text_style":"body"}},"template--18586635469124__f16ad601-9b12-4ae9-9f01-3fe2e731fe47-1686395567ab2145bc-2":{"type":"buttons","settings":{"button_label_1":"Design your own sign","button_link_1":"shopify:\/\/pages\/create-your-own","button_label_2":"","button_link_2":"","m_button_label_1":"","m_button_link_1":"","m_button_label_2":"","m_button_link_2":"","m_button_label_3":"","m_button_link_3":"","m_button_label_4":"","m_button_link_4":"","m_button_label_5":"","m_button_link_5":"","m_button_label_6":"","m_button_link_6":"","m_button_label_7":"","m_button_link_7":"","m_button_label_8":"","m_button_link_8":"","m_button_label_9":"","m_button_link_9":"","m_button_label_10":"","m_button_link_10":""}}},"block_order":["template--18586635469124__f16ad601-9b12-4ae9-9f01-3fe2e731fe47-1686395567ab2145bc-0","template--18586635469124__f16ad601-9b12-4ae9-9f01-3fe2e731fe47-1686395567ab2145bc-1","template--18586635469124__f16ad601-9b12-4ae9-9f01-3fe2e731fe47-1686395567ab2145bc-2"],"settings":{"image":"shopify:\/\/shop_images\/pexels-nguy_n-thanh-tung-9164055.jpg","image_overlay_opacity":0,"image_height":"large","desktop_content_alignment":"center","image_behavior":"none"}},"3ff44431-3725-4bd1-9ad0-a01a136cce26":{"type":"faq-with-heading","blocks":{"70ab19ca-08ed-441e-a0b0-45230600d3bf":{"type":"Answer","settings":{"que":"When will I receive my sign?","ans":"<p>The arrival times for your order may vary based on different factors. LED neon lights generally arrive within <strong>10-14<\/strong> days after ordering, while channel letters, glass neon, and marquee letters usually take around <strong>19-21<\/strong> days to reach you. <\/p><p><\/p><p>Please feel free to call us if you have more questions regarding lead times. <\/p>"}},"5d20c689-5c79-4e84-ba08-9f515be47a7e":{"type":"Answer","settings":{"que":"How do I install my sign?","ans":"<p>Every sign we sell includes a free personalized template that provides detailed instructions for mounting and illuminating your sign. We strive to make the installation process as seamless as possible. Additionally, upon request, our dedicated team can create a custom 3D video rendering that showcases your specific sign and provides a step-by-step demonstration of the mounting and wiring procedure. This extra service ensures that you have clear guidance and support throughout the installation process, guaranteeing a smooth and successful experience. We understand that the installation process of signage can vary based on individual preferences and capabilities. At our company, we offer the flexibility for customers to choose between installing the signs themselves or hiring a professional electrician to ensure a seamless installation experience.<\/p><p>We encourage you to reach out to us at any time if you require additional instructions or further assistance.<\/p>"}},"5d9983b9-749f-4eea-9312-4e1b503580b6":{"type":"Answer","settings":{"que":"What materials are used?","ans":"<p>We take great care in selecting the appropriate materials for each style of signage to ensure durability and longevity. Our fabrication team is dedicated to utilizing the strongest materials available. <\/p><p>For LED neon signs, we use shatter-proof acrylic for the backboard, silicon for the glowing neon tube, and premium LED lights to emulate the letters<\/p><p>Channel letters are crafted using 304 stainless steel, shatterproof acrylic, and high-quality UL-rated LED lights. <\/p><p>Our marquee letters are constructed with double-edged galvanized steel, featuring a high-temperature baked powder coating and the longest-lasting marquee bulbs currently available in the market. <\/p><p>We take pride in utilizing powder coating as the painting method for all our letters. Powder coating is widely recognized as one of the most durable and long-lasting painting techniques available. It provides exceptional durability, ensuring that the color on our letters remains vibrant and intact over an extended period.<\/p><p>Furthermore, powder coating is considered highly eco-friendly. It is free from volatile organic compounds (VOCs) and solvents, minimizing harm to the environment and reducing health risks for both workers and customers.<\/p>"}},"1db62b21-70cf-4c0d-be0d-faa3618de610":{"type":"Answer","settings":{"que":"Is there a warranty?","ans":"<p>At The Signage Company, we take pride in providing unparalleled assurance and support for our valued customers. Each and every product we sell comes with a warranty that surpasses any competition in the market. We believe in the quality and durability of our signs, which is why we offer a comprehensive 3-year warranty.<\/p><p>From the moment your sign leaves our facility until it reaches your doorstep, it is fully insured, ensuring its safe and secure transit. We understand the importance of protecting your investment and strive to provide peace of mind throughout the entire process.<\/p><p>With our extended warranty and insurance coverage, you can trust that we stand behind the quality of our products. In the unlikely event of any issues, our dedicated customer service team is here to assist you promptly and ensure your complete satisfaction. We are committed to delivering not only exceptional signage but also exceptional service and support.<\/p>"}},"b0aa123e-1dde-428e-be46-b7c66a694624":{"type":"Answer","settings":{"que":"Can these signs be used outdoors","ans":"<p>We understand the importance of waterproofing for various signage applications, and we are pleased to offer waterproof options for all our sign styles. Upon request, we can incorporate waterproof LED lights, ensuring their resilience against water exposure. In addition, we take an extra step to enhance waterproofing by encapsulating the entire section of the sign with marine sealant. <\/p><p>This meticulous process provides a double layer of protection, safeguarding the sign from moisture and environmental elements. With our waterproofing measures in place, you can have confidence in the durability and longevity of our signs, even in challenging weather conditions.<\/p>"}},"5ed0cd59-d796-4e90-adf0-a46689b4003e":{"type":"Answer","settings":{"que":"What types of signage options are available?","ans":"<p>Our company takes pride in being a comprehensive signage company, offering a diverse range of sign styles to cater to various needs and preferences. We specialize in providing the following popular styles of signage:<\/p><ol><li>LED Neon Signs: LED neon signs offer a modern twist on traditional neon signs. They feature flexible LED tubes that replicate the vibrant glow of neon while providing energy efficiency and durability.<\/li><li>Channel Letter Signs: Channel letter signs are three-dimensional signs consisting of individual letters or shapes. They are made with stainless steel and acrylic and are often many illuminated options with LED lights.<\/li><li>Marquee Letter Signs: Marquee letter signs evoke a vintage and nostalgic charm. They feature large, illuminated letters that resemble those found on old theater marquees. These signs add a touch of retro elegance to various settings.<\/li><li>Lightboxes: Lightboxes are illuminated display panels that provide a vibrant and eye-catching way to showcase graphics, logos, or messages. They typically consist of a frame, a translucent panel, and internal lighting elements.<\/li><\/ol><p>With our wide range of signage styles, we strive to fulfill the diverse requirements of our customers, whether they are looking for contemporary LED neon signs, attention-grabbing channel letter signs, charming marquee letter signs, or dynamic lightboxes.<\/p><p><\/p>"}},"63146984-8837-4e23-8ef5-db631c9b45c5":{"type":"Answer","settings":{"que":"Can I customize the colors and fonts for my signage?","ans":"<p>Absolutely! We offer a high level of customization to ensure that your sign meets your specific preferences and requirements. You have the flexibility to adjust various features of your sign, including:<\/p><ol><li>Size: We can customize the dimensions of your sign to fit your desired space and visibility requirements.<\/li><li>Font: Choose from a wide range of fonts to create the perfect look for your sign.<\/li><li>Design: Our design team can work with you to create a unique and eye-catching design that aligns with your brand or personal style.<\/li><li>Color: Select from a vast palette of colors to match your branding or personal preferences.<\/li><li>Shape: We can create signs in different shapes, including standard shapes like rectangles and circles, as well as custom shapes to match your specific design concept.<\/li><li>Materials: We offer a variety of materials such as acrylic, stainless steel, aluminum, and more, allowing you to choose the material that best suits your desired aesthetic and durability requirements.<\/li><li>Depth: Customize the depth of your sign to create a three-dimensional effect or a sleek, flat appearance.<\/li><li>Lighting options: Choose from various lighting options, including LED lights, to illuminate your sign and enhance its visibility.<\/li><\/ol><p>These are just a few examples of the customization options available. We are dedicated to providing you with a fully personalized signage solution that meets your vision and exceeds your expectations.<\/p>"}},"05367ad7-bae6-4ea8-aa2d-634acdc0d488":{"type":"Answer","settings":{"que":"What is the expected lifespan of the signage?","ans":"<p>At our company, we pride ourselves on providing signage solutions that not only meet but exceed industry standards in terms of longevity and durability. When it comes to the expected lifespan of our signage, we confidently offer an impressive estimate of up to 100,000 hours of continuous use.<\/p><p>This remarkable lifespan is made possible through our unwavering commitment to utilizing cutting-edge LED technology. LED lights have revolutionized the signage industry, offering exceptional energy efficiency and an extended lifespan compared to traditional lighting options. By incorporating high-quality LEDs in our signage, we ensure that your investment will continue to shine brightly for an extraordinary duration.<\/p><p>With an estimated lifespan of up to 100,000 hours, our signage far surpasses the longevity offered by many competitors in the market. This means that your signage will faithfully display your brand, message, or design for an extensive period without the need for frequent replacements or maintenance.<\/p><p>Our dedication to using premium materials, expert craftsmanship, and rigorous quality control processes further enhances the durability and lifespan of our signage. We understand the importance of providing a signage solution that can withstand the test of time, delivering reliable performance and making a lasting impression on your target audience.<\/p><p>By choosing our company for your signage needs, you are investing in a product that not only promises exceptional quality and longevity but also showcases our commitment to surpassing customer expectations. Experience the confidence of signage that lasts up to 100,000 hours, ensuring that your brand remains prominently displayed and making an impact for years to come.<\/p>"}},"d45a908d-321a-4992-beae-3c72b2f69545":{"type":"Answer","settings":{"que":"Can you provide a mockup or proof of how the signage will look before production?","ans":"<p>Absolutely! We understand the importance of visualizing your signage before production, and we offer the service of providing mockups or proofs to give you a clear representation of how the signage will look.<\/p><p>Our design team is skilled in creating detailed mockups and proofs based on your specific requirements and design preferences. We take into consideration factors such as size, color, font, and overall design aesthetics to ensure an accurate representation of the final product.<\/p><p>Upon request, we can provide digital mockups or proofs that showcase your signage design in a realistic manner. This allows you to preview and evaluate the visual impact of the signage, ensuring it aligns with your branding or personal vision.<\/p><p>We encourage open communication and collaboration during the mockup or proofing process. If any adjustments or modifications are desired, our team is readily available to work with you to refine the design until you are completely satisfied.<\/p><p>By providing mockups or proofs, we aim to give you confidence in your signage investment and ensure that the end result meets or exceeds your expectations. We believe in transparent and collaborative processes, and our mockup service is just one of the ways we strive to deliver exceptional customer satisfaction.<\/p><p>Please don't hesitate to reach out to our team to discuss your specific signage requirements and request a mockup or proof. We are committed to bringing your signage vision to life and ensuring your complete satisfaction throughout the design and production journey.<\/p>"}}},"block_order":["70ab19ca-08ed-441e-a0b0-45230600d3bf","5d20c689-5c79-4e84-ba08-9f515be47a7e","5d9983b9-749f-4eea-9312-4e1b503580b6","1db62b21-70cf-4c0d-be0d-faa3618de610","b0aa123e-1dde-428e-be46-b7c66a694624","5ed0cd59-d796-4e90-adf0-a46689b4003e","63146984-8837-4e23-8ef5-db631c9b45c5","05367ad7-bae6-4ea8-aa2d-634acdc0d488","d45a908d-321a-4992-beae-3c72b2f69545"],"settings":{"faq_heading":"Frequently Asked Questions","faq_content":""}}},"order":["main","1699299147ec19a30f","69ba3784-4356-4016-bd99-37fe72d2e5c9","related-products","f16ad601-9b12-4ae9-9f01-3fe2e731fe47","3ff44431-3725-4bd1-9ad0-a01a136cce26"]}